# synth_script.ys

read_verilog sync_arith_unit_29.sv
synth -top sync_arith_unit_29
write_verilog synth_sync_arith_unit_29.v
